publish/notes/202304110005-SRE.001-overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-26 Sun 14:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Overview</title>
<meta name="author" content="ahnaf" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Overview</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org91b8350">1. Overview Depth</a></li>
<li><a href="#org356c4cd">2. Story</a></li>
<li><a href="#orgca19251">3. Free Courses</a></li>
<li><a href="#org309e4b6">4. DevSecOps (DSO) Domain Scope</a></li>
<li><a href="#org23173ac">5. What is DevOps?</a>
<ul>
<li><a href="#org15a01a6">5.1. Four Core DSO Principles:</a></li>
</ul>
</li>
<li><a href="#orgb6d51ea">6. Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org91b8350" class="outline-2">
<h2 id="org91b8350"><span class="section-number-2">1.</span> Overview Depth</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Embed Security in DevOps</li>
<li>Secure SDLC</li>
<li>Infra as Code</li>
<li>Compliance as Code</li>
<li>Consolidate and Relate Vulnerabilities</li>
</ol>
</div>
</div>

<div id="outline-container-org356c4cd" class="outline-2">
<h2 id="org356c4cd"><span class="section-number-2">2.</span> Story</h2>
<div class="outline-text-2" id="text-2">
<p>
A CISO's (Chief Info Sec Officer) duty to ensure application are
secured. Usually this can be further divided into two categories:
</p>

<ol class="org-ol">
<li>InfoSec Engineer
<ul class="org-ul">
<li>Network Sec Engineer</li>
</ul></li>
<li>AppSec Engineer</li>
</ol>

<p>
Security Issues are generally due to 3 reasons:
</p>

<ol class="org-ol">
<li>Lack of Infra Hardening</li>
<li>Lack of Visibility into Environment</li>
<li>Lack of Security focus from the beginning of the SDLC</li>
</ol>

<p>
Additional of those items will definitely slow down Product Deployment, but
it's essential that the process remains smooth
</p>
</div>
</div>

<div id="outline-container-orgca19251" class="outline-2">
<h2 id="orgca19251"><span class="section-number-2">3.</span> Free Courses</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>AppSec Course: <a href="https://www.hacker101.com/videos">https://www.hacker101.com/videos</a></li>
<li>WebApplication Security: <a href="https://portswigger.net/web-security/all-materials">https://portswigger.net/web-security/all-materials</a></li>
</ol>
</div>
</div>

<div id="outline-container-org309e4b6" class="outline-2">
<h2 id="org309e4b6"><span class="section-number-2">4.</span> DevSecOps (DSO) Domain Scope</h2>
<div class="outline-text-2" id="text-4">
<p>
  The domain of DSO contains a lot of things, including providing the correct
background of training people in the DevSecOps lifecycle. Microsoft has
efficiently captures the Deployment LifeCycle here:
<a href="https://www.microsoft.com/en-us/securityengineering/devsecops">https://www.microsoft.com/en-us/securityengineering/devsecops</a>. It's a Culture,
and not just a routine.
</p>
</div>
</div>


<div id="outline-container-org23173ac" class="outline-2">
<h2 id="org23173ac"><span class="section-number-2">5.</span> What is DevOps?</h2>
<div class="outline-text-2" id="text-5">
<p>
A software engineering practice that attempts to unify software development
and software operation. A typical cycle has 7 stages:
</p>

<ol class="org-ol">
<li>Plan and Create: Plan and implement the code using SCM</li>
<li>Verify: Verify that the code does what the business wants</li>
<li>Package: Code should be in a deployable artifcate, ready to be tested in
a staging environment</li>
<li>Release: Product ready artiefact after release approvals</li>
<li>Configure: Configuration management of application stack</li>
<li>Monitor: Monitor application performance</li>
</ol>

<p>
A good implementation of DSO would achieve the following, in no particular
order:
</p>

<ul class="org-ul">
<li>Reslience: Helps organization design and build resilient systems</li>
<li>Flexibility: Be Agile</li>
<li>Speed: Speed is competitive advantage</li>
<li>Reliability: DSO reduces failure rates</li>
<li>Automation: Reduces complexity as scale</li>
</ul>

<p>
And an implementation consists of the following items:
</p>

<ol class="org-ol">
<li>Embed Security in Pipeline</li>
<li>Give Devs Visitlity into Security Activities</li>
<li>Encourage people to pick security tasks</li>
<li>Eveything as code: Compliance as code, hardening via configuraiton
management systems</li>
<li>Use better securty frameworks</li>
<li>Use Maturity Models</li>
</ol>
</div>

<div id="outline-container-org15a01a6" class="outline-3">
<h3 id="org15a01a6"><span class="section-number-3">5.1.</span> Four Core DSO Principles:</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Automation</li>
<li>Culture: Is the most under appreciated</li>
<li>Sharing</li>
<li>Communication</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb6d51ea" class="outline-2">
<h2 id="orgb6d51ea"><span class="section-number-2">6.</span> Resources</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Main: <a href="https://www.practical-devsecops.com/devsecops-university/">https://www.practical-devsecops.com/devsecops-university/</a></li>
<li>Tools: <a href="https://github.com/analysis-tools-dev/static-analysis">https://github.com/analysis-tools-dev/static-analysis</a></li>
<li>Site Scan: <a href="https://github.com/ssllabs/ssllabs-scan">https://github.com/ssllabs/ssllabs-scan</a></li>
<li>Docker Benchmark: <a href="https://github.com/dev-sec/cis-docker-benchmark">https://github.com/dev-sec/cis-docker-benchmark</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-01-08 Sat 00:00</p>
<p class="author">Author: ahnaf</p>
<p class="date">Created: 2025-01-26 Sun 14:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
